import React from 'react';

export default function AboutRight() {
  return (
    <div className='flex-2 p-4 flex flex-col gap-4 justify-center'>
      <h3>[배우고 도전하는 개발자] </h3>
      <p>
        프론트엔드 개발자로서 전문성을 갖추기 위해 구름 딥다이브 교육 과정을
        수강하며 React, Next.js, TypeScript를 학습했습니다. 다양한 실습
        프로젝트를 통해 상태 관리, 컴포넌트 분리, 라우팅 등을 직접 구현해보며
        실무 역량을 키웠습니다. 특히 Next.js와 TypeScript 를 활용한 협업
        프로젝트에서 CRUD 기능을 직접 구현하며 실무와 유사한 개발 경험을
        쌓았습니다. 이 과정에서 코드 리뷰와 협업 도구 사용법도 함께 익혔습니다.
      </p>
      <h3>[원활한 소통과 협업이 가능한 개발자]</h3>
      <p>
        저는 차분한 성격으로, 팀 프로젝트에서도 경청과 조율을 우선시합니다.
        팀원들의 의견을 주의 깊게 듣고, 제 의견을 전달할 때는 상대방의 기분을
        배려하며 의견을 전달하려고 노력합니다. 앞으로는 다양한 사용자들의
        접근성을 고려한 UI를 구현하고, 협업과 유지보수가 용이한 코드를 작성하는
        개발자로 성장하고 싶습니다. 또한 현재에 만족하지 않고 끊임 없이 고민하고
        배우며 한 걸음씩 성장하는 개발자가 되겠습니다.
      </p>
    </div>
  );
}
